# FabricationHangerNotConnectToHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationHangerNotConnectToHost Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Fabrication Hanger didn't connect to the %s host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationHangerNotConnectToHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationHangerNotConnectToHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationHangerNotConnectToHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace